pages/0_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Intro to Linux</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Intro to Linux</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/digixc/9-CS-LinuxIntro.git">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>

      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="homework.html">Homework</a></li>

    </ul>
  </div>


<div id="underlay" onclick="underlayoff()">
</div>
<div id="overlay" onclick="overlayoff()">
</div>
<div id=overlayMenu>
<p onclick="overlayon('hsla(0, 0%, 50%, 0.5)')">Grey overlay</p>
<p onclick="underlayon('hsla(300,100%,50%, 0.3)')">Pink</p>
<p onclick="underlayon('hsla(80, 90%, 40%, 0.4)')">Green</p>
<p onclick="underlayon('hsla(240,100%,50%,0.2)')">Blue</p>
<p onclick="underlayon('hsla(40,100%,50%,0.3)')">Cream</p>
<p onclick="underlayon('hsla(300,100%,40%,0.3)')">Liliac</p>
<p onclick="underlayon('hsla(300,100%,25%,0.3)')">Purple</p>
<p onclick="underlayon('hsla(60,100%,50%,0.3)')">Yellow</p>
</div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">Overview of this Unit.</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-sec-1-1" class="outline-3 objectives">
<h3 id="sec-1-1">This unit is designed for you to work towards the following strand of your progress ladder:</h3>
<div class="outline-text-3" id="text-1-1">

<p>
<b>Information Technology</b>
</p>
<ul class="org-ul">
<li>Collects, organises and presents data and information in digital content. 
</li>
<li>Understands there are variety of operating systems in addition to those commonly used at home. 
</li>
<li>Develops understanding the common features shared by different operating systems.
</li>
</ul>



<p>
<b>Hardware and Processing</b>
</p>
<ul class="org-ul">
<li>Understands the main functions of the operating system.
</li>
<li>Knows that there is a range of operating systems and application software for the same hardware.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3 objectives">
<h3 id="sec-1-2">Key Words and Key Concepts</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Operating System
</li>
<li>Platform
</li>
<li>File system
</li>
<li>Directory
</li>
<li>Command line interface
</li>
<li>Terminal
</li>
<li>SSH
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
